t21/Walnut_X/Packages/.cache/Keil.LPC1300_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LPC1300_DFP</name>
  <description>NXP LPC1300 Series Device Support</description>

  <releases>
    <release version="1.0.0">
      First Release version of LPC1300 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>NXP</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package NXP</keyword>
    <keyword>LPC1300</keyword>
    <keyword>LPC13xx</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="LPC1300 Series" Dvendor="NXP:11">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <book    name="Documents\dui0552a_cortex_m3_dgug.pdf"           title="Cortex-M3 Generic User Guide"/>
        <description>
The LPC1300 series is designed for embedded applications featuring a high level of integration and low power consumption.
Equipped with a highly flexible and configurable Full-Speed USB 2.0 device controller available on the LPC1345/46/47, this series brings unparalleled design flexibility and seamless integration to today's demanding connectivity solutions.
Typical applications include Consumer peripherals, Handheld scanners, Medical, USB audio devices, Industrial control, eMetering, Lighting, Alarm systems and White goods.

  - Non Maskable Interrupt (NMI) input selectable from several input sources
  - Four reduced power modes: Sleep, Deep-sleep, Power-down, and Deep power-down.
  - Unique device serial number for identification.
  - 16 kB boot ROM with API support for USB API, power control, EEPROM, and flash IAP/ISP.
  - Programmable Windowed WatchDog Timer (WWDT) with a internal low-power WatchDog Oscillator (WDO).
  - Code Read Protection (CRP) with different security levels.
        </description>

        <feature type="I2C"           n="1"/>
        <feature type="ADC"           n="8"       m="12"/>
        <feature type="WDT"           n="1"                           name="Windowed Watchdog Timer"/>
        <feature type="RTC"           n="1"       m="32768"/>
        <feature type="DMA"           n="1"/>
        <feature type="Timer"         n="1"                           name="Repetitive Interrupt Timer (RI Timer)"/>
        <feature type="USART"         n="1"       m="3125000"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="Timer"         n="1"       m="16"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>


      <!-- ************************  Subfamily 'LPC1311'  **************************** -->
      <subFamily DsubFamily="LPC1311">
        <feature type="SPI"           n="1"       m="25000000"/>
        <feature type="MPSerial"      n="1"/>
        <feature type="IOs"           n="33"/>
        <feature type="QFN"           n="33"/>
      
      <!-- *************************  Device 'LPC1311FHN33'  ***************************** -->
      <device Dname="LPC1311FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1311_13_ES.pdf"                    title="LPC1311/13 Series Erratasheet"/>
      </device>
      
      <!-- *************************  Device 'LPC1311FHN33/01'  ***************************** -->
      <device Dname="LPC1311FHN33/01">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x2000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_8.FLM"      start="0x00000000"  size="0x2000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1311_13_ES.pdf"                    title="LPC1311/13 Series Erratasheet"/>
        <feature type="PowerOther"    n="1"                           name="Power profiles"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1313'  **************************** -->
      <subFamily DsubFamily="LPC1313">
        <feature type="SPI"           n="1"       m="25000000"/>
        <feature type="MPSerial"      n="1"/>
      
      <!-- *************************  Device 'LPC1313FHN33'  ***************************** -->
      <device Dname="LPC1313FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1311_13_ES.pdf"                    title="LPC1311/13 Series Erratasheet"/>
        <feature type="IOs"           n="33"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'LPC1313FHN33/01'  ***************************** -->
      <device Dname="LPC1313FHN33/01">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1311_13_ES.pdf"                    title="LPC1311/13 Series Erratasheet"/>
        <feature type="PowerOther"    n="1"                           name="Power profiles"/>
        <feature type="IOs"           n="33"/>
        <feature type="QFN"           n="33"/>
      </device>
      
