t21/Walnut_X/Packages/.cache/Keil.LPC1300_DFP.1.0.0.pdsc
      <!-- *************************  Device 'LPC1317FHN33'  ***************************** -->
      <device Dname="LPC1317FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <book       name="Documents\LPC131x_01_ES.pdf"                    title="LPC131x/01 Series Erratasheet"/>
        <feature type="IOs"           n="28"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'LPC1317FBD48'  ***************************** -->
      <device Dname="LPC1317FBD48">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <book       name="Documents\LPC131x_01_ES.pdf"                    title="LPC131x/01 Series Erratasheet"/>
        <feature type="IOs"           n="40"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'LPC1317FBD64'  ***************************** -->
      <device Dname="LPC1317FBD64">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <book       name="Documents\LPC131x_01_ES.pdf"                    title="LPC131x/01 Series Erratasheet"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1342'  **************************** -->
      <subFamily DsubFamily="LPC1342">
        <feature type="USBD"          n="1"/>
        <feature type="SPI"           n="1"       m="25000000"/>
        <feature type="MPSerial"      n="1"/>
      
      <!-- *************************  Device 'LPC1342FHN33'  ***************************** -->
      <device Dname="LPC1342FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1342_43_ES.pdf"                    title="LLPC1342/43 Series Erratasheet"/>
        <feature type="IOs"           n="33"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'LPC1342FBD48'  ***************************** -->
      <device Dname="LPC1342FBD48">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x1000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_16.FLM"     start="0x00000000"  size="0x4000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1342_43_ES.pdf"                    title="LLPC1342/43 Series Erratasheet"/>
        <feature type="IOs"           n="48"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1343'  **************************** -->
      <subFamily DsubFamily="LPC1343">
        <feature type="USBD"          n="1"/>
        <feature type="SPI"           n="1"       m="25000000"/>
        <feature type="MPSerial"      n="1"/>
      
      <!-- *************************  Device 'LPC1343FHN33'  ***************************** -->
      <device Dname="LPC1343FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1342_43_ES.pdf"                    title="LLPC1342/43 Series Erratasheet"/>
        <feature type="IOs"           n="33"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'LPC1343FBD48'  ***************************** -->
      <device Dname="LPC1343FBD48">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13xx\LPC13xx.h"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1311_13_42_43_UM.PDF"              title="LPC1311/13/42/43 Series Reference Manual"/>
        <book       name="Documents\LPC1311_13_42_43_DS.PDF"              title="LPC1311/13/42/43 Series Datasheet"/>
        <book       name="Documents\LPC1342_43_ES.pdf"                    title="LLPC1342/43 Series Erratasheet"/>
        <feature type="IOs"           n="48"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1345'  **************************** -->
      <subFamily DsubFamily="LPC1345">
        <feature type="USBD"          n="1"/>
        <feature type="MemoryOther"   n="1"                           name="2kB EEPROM"/>
        <feature type="SPI"           n="2"       m="25000000"/>
        <feature type="MPSerial"      n="2"/>
      
      <!-- *************************  Device 'LPC1345FHN33'  ***************************** -->
      <device Dname="LPC1345FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="26"/>
        <feature type="QFN"           n="33"/>
      </device>
      
