t21/Walnut_X/Packages/.cache/Keil.LPC1300_DFP.1.0.0.pdsc
      <!-- *************************  Device 'LPC1345FBD48'  ***************************** -->
      <device Dname="LPC1345FBD48">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_32.FLM"     start="0x00000000"  size="0x8000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="40"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1346'  **************************** -->
      <subFamily DsubFamily="LPC1346">
        <feature type="USBD"          n="1"/>
        <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
        <feature type="SPI"           n="2"       m="25000000"/>
        <feature type="MPSerial"      n="2"/>
      
      <!-- *************************  Device 'LPC1346FHN33'  ***************************** -->
      <device Dname="LPC1346FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_48.FLM"     start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="26"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'LPC1346FBD48'  ***************************** -->
      <device Dname="LPC1346FBD48">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0xC000"     startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_48.FLM"     start="0x00000000"  size="0xC000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="40"/>
        <feature type="QFP"           n="48"/>
      </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC1347'  **************************** -->
      <subFamily DsubFamily="LPC1347">
        <feature type="USBD"          n="1"/>
        <feature type="MemoryOther"   n="1"                           name="4kB EEPROM"/>
        <feature type="SPI"           n="2"       m="25000000"/>
        <feature type="MPSerial"      n="2"/>
      
      <!-- *************************  Device 'LPC1347FHN33'  ***************************** -->
      <device Dname="LPC1347FHN33">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="26"/>
        <feature type="QFN"           n="33"/>
      </device>
      
      <!-- *************************  Device 'LPC1347FBD48'  ***************************** -->
      <device Dname="LPC1347FBD48">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="40"/>
        <feature type="QFP"           n="48"/>
      </device>
      
      <!-- *************************  Device 'LPC1347FBD64'  ***************************** -->
      <device Dname="LPC1347FBD64">
        <processor Dclock="72000000"/>
        <compile header="Device\Include\LPC13Uxx\LPC13Uxx.h"/>
        <debug      svd="SVD\LPC13Uxx.svd"/>
        <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x10000000"  size="0x2000"     init   ="0"   default="1"/>
        <memory     id="IRAM2"                      start="0x20000000"  size="0x0800"     init   ="0"   default="1"/>
        <algorithm  name="Flash\LPC1xxx_64.FLM"     start="0x00000000"  size="0x10000"  RAMstart="0x10000000"  RAMsize="0x0FE0"  default="1"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_UM.PDF"         title="LPC1315/16/17/45/46/47 Series Reference Manual"/>
        <book       name="Documents\LPC1315_16_17_45_46_47_DS.pdf"        title="LPC1315/16/17/45/46/47 Series Datasheet"/>
        <feature type="IOs"           n="51"/>
        <feature type="QFP"           n="64"/>
      </device>
      </subFamily>

    </family>
  </devices>

