t21/Walnut_X/Packages/.cache/Keil.LPC1300_DFP.1.0.0.pdsc
  <boards>
    <board vendor="Keil" name="MCB1313" revision="Ver 2.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1000=ON">
      <description>Keil MCB1000 Board Support and Examples</description>
      <image small="Images\mcb1000.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1000/" title="MCB1000 Web Page"/>
      <book category="schematic" name="Documents\mcb1000-schematics.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1313FBD48"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC1313"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device with USB Standard-B Connector"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="CAN"       n="1"              name="DB9 Male Connector"/>
      <feature type="Poti"      n="1"/>
      <feature type="LED"       n="9"              name="LEDs: eight user, one PWR LED"/>
      <feature type="Button"    n="4"              name="Push-buttons: 2 GPIO, ISP and Reset"/>
      <feature type="ConnOther" n="1"              name="10pin Cortex Debug Interface"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="CustomFF"  n="80" m="80"/>
    </board>

    <board vendor="Keil" name="MCB1343" revision="Ver 2.0" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCB1000=ON">
      <description>Keil MCB1000 Board Support and Examples</description>
      <image small="Images\mcb1000.jpg"/>
      <book category="overview"  name="http://www.keil.com/mcb1000/" title="MCB1000 Web Page"/>
      <book category="schematic" name="Documents\mcb1000-schematics.pdf" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="LPC1343FBD48"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" DsubFamily="LPC1343"/>
      <feature type="USB"       n="1"              name="Full-Speed USB device with USB Standard-B Connector"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="RS232"     n="1"              name="DB9 Female Connector"/>
      <feature type="CAN"       n="1"              name="DB9 Male Connector"/>
      <feature type="Poti"      n="1"/>
      <feature type="LED"       n="9"              name="LEDs: eight user, one PWR LED"/>
      <feature type="Button"    n="4"              name="Push-buttons: 2 GPIO, ISP and Reset"/>
      <feature type="ConnOther" n="1"              name="10pin Cortex Debug Interface"/>
      <feature type="XTAL"      n="12000000"/>
      <feature type="CustomFF"  n="80" m="80"/>
    </board>

  </boards>


  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="LPC1300 CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>NXP LPC1300 Series devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Dvendor="NXP:11" Dname="LPC13*"/>
    </condition>

    <condition id="LPC13Uxx">
      <description>NXP LPC1300 Series devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="LPC1345*"/>
      <accept Dname="LPC1346*"/>
      <accept Dname="LPC1347*"/>
      <accept Dname="LPC1315*"/>
      <accept Dname="LPC1316*"/>
      <accept Dname="LPC1317*"/>
    </condition>

    <condition id="LPC13xx">
      <description>NXP LPC1300 Series devices</description>
      <require Dvendor="NXP:11"/>
      <accept Dname="LPC1311*"/>
      <accept Dname="LPC1313*"/>
      <accept Dname="LPC1342*"/>
      <accept Dname="LPC1343*"/>
    </condition>
  </conditions>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB1313\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1313" vendor="Keil" Dvendor="NXP:11" Dname="LPC1313FBD48"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB1343\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB1343" vendor="Keil" Dvendor="NXP:11" Dname="LPC1343FBD48"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

  

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC1300 CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for NXP LPC1300 Series</description>

      <files>
        <!-- header files -->
        <file category="header" name="Device\Include\LPC13xx\LPC13xx.h"                              condition="LPC13xx" />
        <file category="header" name="Device\Include\LPC13Uxx\LPC13Uxx.h"                            condition="LPC13Uxx" />

        <!-- startup files -->
        <file category="source" name="Device\Source\ARM\startup_LPC13xx.s"         attr="config"     condition="LPC13xx" />
        <file category="source" name="Device\Source\ARM\startup_LPC13Uxx.s"        attr="config"     condition="LPC13Uxx" />

        <!-- system file -->
        <file category="source" name="Device\Source\system_LPC13xx.c"              attr="config"     condition="LPC13xx" />
        <file category="source" name="Device\Source\system_LPC13Uxx.c"             attr="config"     condition="LPC13Uxx" />
      </files>
    </component>

  </components>
</package>
